---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralFileCommunicationException
source: html/20094e4f-8326-8378-e5bc-452341d131c2.htm
---
# Autodesk.Revit.Exceptions.CentralFileCommunicationException

The exception thrown when there is a network communication error involving a file-based central model.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralFileCommunicationException : CentralModelException
```